//BRXGEN   JOB CLASS=C,REGION=0K
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  DEFINE ALIAS (NAME(BREXX) RELATE(SYS1.UCAT.TSO)) -
         CATALOG(SYS1.VMASTCAT/SECRET)
  SET MAXCC=0
/*
//
/* REXX VERSION OF THE BOTTLES PROGRAM */                              
/* BY L Kuperberg  laurent.kuperberg@halcom.fr */                      
        I = 99                                                                 
        CALL CHANTE                                                            
        SAY 'TAKE ONE DOWN, PASS IT AROUND, NO MORE BOTTLES ',                 
            'OF BEER ON THE WALL'                                              
        SAY ' '                                                                
        SAY 'NO MORE BOTTLES OF BEER ON THE WALL, NO MORE BOTTLES OF BEER'     
        SAY 'GO TO THE STORE AND BUY SOME MORE' , 
             '99 BOTTLES OF BEER ON THE WALL. '
           
        RETURN                                                                 

        CHANTE:                                                                
          SAY I BOTTLES 'OF BEER ON THE WALL, ' BOTTLES 'OF BEER'              
          I = I - 1                                                            
          SELECT                                                               
            WHEN I = 0 THEN RETURN                                             
            WHEN I = 1 THEN BOTTLES = BOTTLE                                   
            OTHERWISE                                                          
               NOP                                                             
          END                                                                  
          SAY 'TAKE ONE DOWN, PASS IT AROUND,' I BOTTLES  'OF BEER ON THE WALL'
          SAY ' '                                                              
          CALL CHANTE                                                          
        RETURN
