//HERC01C JOB (COBOL),
//             '99 BOTTLES OF BEER',
//             CLASS=A,
//             MSGCLASS=A,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//*  USER=HERC01,PASSWORD=CUL8TR
//PRIMES   EXEC COBUCG,
//         PARM.COB='FLAGW,LOAD,SUPMAP,SIZE=2048K,BUF=1024K'
//COB.SYSPUNCH DD DUMMY
//COB.SYSIN    DD *
        IDENTIFICATION DIVISION.
        PROGRAM-ID. 99-BOTTLES-OF-BEER-ON-THE-WALL.
        AUTHOR. JOSEPH JAMES FRANTZ.
       *COMMENTS.
       ******************************************************************
       * PURPOSE:
       *   THIS IS A SAMPLE COBOL PROGRAM TO DISPLAY THE LYRICS OF THE
       *   SONG "99 BOTTLES OF BEER ON THE WALL."
       *   THIS VERSION OF THE COBOL 99 BEERS PROGRAM DEMONSTRATES A FEW
       *   FEATURES OF COBOL:
       *
       *   1. PERFORM VARYING, COBOL'S VERSION OF A LOOP.
       *   2. ADD/SUBTRACT WITH GIVING FOR MATH CALCULATIONS.
       *   3. EVALUATE/WHEN, COBOL'S VERSION OF CASE.
       *   4. INSPECT/TALLYING, WHICH FINDS THE NUMBER OF SPECIFIED
       *      CHARACTERS IN A VARIABLE.
       *   5. REFERENCE MODIFICATION:
       *      VAR-NAME(START CHARACTER:NUMBER OF CHARACTERS)
       *      WHICH IS ESSENTIALLY COBOL'S VERSION OF TEXT SUBSCRIPTING.
       *   6. LONG DESCRIPTIVE VARIABLE NAMES.
       *   7. USE OF SPACES AND ZEROES FOR FIELD/DISPLAY VALUES.
       *   8. HIGHLIGHT THE SELF DOCUMENTING NATURE OF COBOL.
       ******************************************************************
       **
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 KEEPING-TRACK-VARIABLES.
            05 BOTTLES                      PIC S99   VALUE 0.
            05 REMAINING-BOTTLES            PIC S99   VALUE 0.
            05 COUNTING                     PIC 99    VALUE 0.
            05 START-POSITION               PIC 99    VALUE 0.
            05 POSITIONS                    PIC 99    VALUE 0.
       **
        PROCEDURE DIVISION.
            PASS-AROUND-THOSE-BEERS.
        PERFORM VARYING BOTTLES FROM 99 BY -1 UNTIL BOTTLES = -1
            DISPLAY SPACES
            SUBTRACT 1 FROM BOTTLES GIVING REMAINING-BOTTLES
            EVALUATE Bottles
            WHEN 0
                DISPLAY "No more bottles of beer on the wall, "
                    "no more bottles of beer."
                DISPLAY "Go to the store and buy some more, "
                    "99 bottles of beer on the wall."
            WHEN 1
                DISPLAY "1 bottle of beer on the wall, "
                    "1 bottle of beer."
                DISPLAY "Take one down and pass it around, "
                    "no more bottles of beer on the wall."
            WHEN 2 Thru 99
                MOVE ZEROES TO Counting
                INSPECT Bottles,
                TALLYING COUNTING FOR LEADING ZEROES
                ADD 1 TO COUNTING GIVING START-POSITION
                SUBTRACT COUNTING FROM 2 GIVING POSITIONS
                DISPLAY BOTTLES(START-POSITION:POSITIONS)
                          " bottles of beer on the wall, "
                      BOTTLES(START-POSITION:POSITIONS)
                          " bottles of beer."
                MOVE ZEROES TO Counting
                INSPECT Remaining-Bottles TALLYING
                Counting FOR LEADING ZEROES
                ADD 1 TO Counting GIVING Start-Position
                SUBTRACT Counting FROM 2 GIVING Positions
                DISPLAY "Take one down and pass it around, "
                      REMAINING-BOTTLES(START-POSITION:POSITIONS)
                          " bottles of beer on the wall."
            END-EVALUATE
        END-PERFORM
        STOP RUN.

