
//HERC01C JOB (COBOL),
//             'HELLO WORLD!',
//             CLASS=A,
//             MSGCLASS=A,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//*  USER=HERC01,PASSWORD=CUL8TR
//PRIMES   EXEC COBUCG,
//         PARM.COB='FLAGW,LOAD,SUPMAP,SIZE=2048K,BUF=1024K'
//COB.SYSPUNCH DD DUMMY
//COB.SYSIN    DD *
        PROGRAM-ID. HELLO.
        PROCEDURE DIVISION.
        DISPLAY "HELLO WORLD!".
        STOP RUN.

