//HERC01C JOB (COBOL),
//             'FIZZBUZZ',
//             CLASS=A,
//             MSGCLASS=A,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//*  USER=HERC01,PASSWORD=CUL8TR
//PRIMES   EXEC COBUCG,
//         PARM.COB='FLAGW,LOAD,SUPMAP,SIZE=2048K,BUF=1024K'
//COB.SYSPUNCH DD DUMMY
//COB.SYSIN    DD *
        IDENTIFICATION DIVISION.
        PROGRAM-ID. FIZZ-BUZZ.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
            01 NUM PIC 999.
        PROCEDURE DIVISION.
       * SIMPLER VERSION

        PERFORM VARYING NUM FROM 1 BY 1 UNTIL NUM > 100
            IF FUNCTION MOD (NUM, 15) = 0 THEN DISPLAY "FIZZBUZZ"
            ELSE IF FUNCTION MOD (NUM, 3) = 0 THEN DISPLAY "FIZZ"
            ELSE IF FUNCTION MOD (NUM, 5) = 0 THEN DISPLAY "BUZZ"
            ELSE 
                DISPLAY NUM
            END-PERFORM.
        STOP RUN.
