//BRXGEN   JOB CLASS=C,REGION=0K
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  DEFINE ALIAS (NAME(BREXX) RELATE(SYS1.UCAT.TSO)) -
         CATALOG(SYS1.VMASTCAT/SECRET)
  SET MAXCC=0
/*
//
/*REXX PROGRAM FINDS THE  LOWEST (POSITIVE)  INTEGER  WHOSE  SQUARE  ENDS IN  269,696.  */
           DO J=2  BY 2  UNTIL RIGHT(J * J, 6) == 269696 /*START  J  AT TWO,  INCREMENT BY TWO. */
           END                                           /*◄── SIGNIFIES THE END OF THE DO LOOP.*/
                                                         /* [↑]     *     MEANS MULTIPLICATION. */
        SAY "THE SMALLEST INTEGER WHOSE SQUARE ENDS IN  269,696  IS: "    J


