//BRXGEN   JOB CLASS=C,REGION=0K
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  DEFINE ALIAS (NAME(BREXX) RELATE(SYS1.UCAT.TSO)) -
         CATALOG(SYS1.VMASTCAT/SECRET)
  SET MAXCC=0
/*
//
/*REXX program spits out decimal digits of pi  (one digit at a time)  until  Ctrl-Break.*/
        PARSE ARG DIGS OFID .                            /*OBTAIN OPTIONAL ARGUMENT FROM THE CL.*/
        IF DIGS=='' | DIGS==","  THEN DIGS=1E6           /*NOT SPECIFIED?  THEN USE THE DEFAULT.*/
        IF OFID=='' | OFID==","  THEN OFID='PI_SPIT.OUT' /* "      "         "   "   "      "   */
        NUMERIC DIGITS DIGS                              /*WITH BIGGER DIGS, SPITTING IS SLOWER.*/
        CALL TIME 'RESET'                                /*RESET THE WALL─CLOCK (ELAPSED) TIMER.*/
        SIGNAL ON HALT                                   /*───► HALT WHEN CTRL─BREAK IS PRESSED.*/
        PI=0;  V=5;   VV=V*V;   G=239;   GG=G*G;  SPIT=0 /*ASSIGN SOME VALUES TO SOME VARIABLES.*/
        S=16                                             /*CALCULATE Π WITH INCREASING ACCURACY */
        R=4;    DO N=1  BY 2  UNTIL  OLD=PI;      OLD=PI /*JUST CALCULATE  PI  WITH ODD INTEGERS*/
                PI=PI + S/(N*V) - R/(N*G)                /*    ···  USING JOHN MACHIN'S FORMULA.*/
                IF PI==OLD  THEN LEAVE                   /*HAVE WE EXCEEDED THE DIGITS ACCURACY?*/
                S=-S;             R=-R;  V=V*VV;  G=G*GG /*COMPUTE SOME VARIABLES FOR SHORTCUTS.*/
                         DO J=SPIT+1  TO COMPARE(PI,OLD) /*SPIT OUT SOME (NEW)  DIGITS OF Π (PI)*/
                         PARSE VAR  PI  =(J)  SPIT  +1   /*EQUIVALENT TO:   SPIT=SUBSTR(PI,J,1) */
                         CALL CHAROUT     ,SPIT          /*DISPLAY ONE (NEW) DECIMAL DIGIT OF Π.*/
                         CALL CHAROUT OFID,SPIT          /*··· AND ALSO WRITE Π DIGIT TO A FILE.*/
                         END   /*J*/                     /* [↑]  0, 1, OR 2 DECIMAL DIG ARE SPIT*/
                SPIT=J-1                                 /*ADJUST FOR  DO  LOOP INDEX INCREMENT.*/
                END            /*N*/
        SAY                                              /*STICK A FORK IN IT,  WE'RE ALL DONE. */
        EXIT: SAY;  SAY N%2+1  'ITERATIONS TOOK'  FORMAT(TIME("ELAPSED"),,2)  'SECONDS.';     EXIT
        HALT: SAY;  SAY 'PI_SPIT HALTED VIA USE OF CTRL-BREAK.';  SIGNAL EXIT /*SHOW ITERATIONS.*/
        /* USING JOHN MACHIN'S FORMULA  PI/4 = 4 . ARCTAN [1/5] - ARCTAN[1/239] */
