//BRXGEN   JOB CLASS=C,REGION=0K
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  DEFINE ALIAS (NAME(BREXX) RELATE(SYS1.UCAT.TSO)) -
         CATALOG(SYS1.VMASTCAT/SECRET)
  SET MAXCC=0
/*
//
/*REXX PROGRAM  COMPUTES  THE  FACTORIAL  OF AN  INTEGER,  STRIPING TRAILING ZEROES.    */
        NUMERIC DIGITS 200                               /*START WITH TWO HUNDRED DIGITS.       */
        PARSE ARG N .;     IF N==''  THEN N=0            /*OBTAIN THE OPTIONAL ARGUMENT FROM CL.*/
         
        !=1                                              /*DEFINE THE FACTORIAL PRODUCT SO FAR. */
            DO J=2  TO N                                 /*COMPUTE FACTORIAL THE HARD WAY.      */
            OLD!=!                                       /*SAVE OLD PRODUCT IN CASE OF OVERFLOW.*/
            !=!*J                                        /*MULTIPLE THE OLD FACTORIAL WITH   J. */
            IF POS(.,!) \==0  THEN DO                    /*IS THE   !   IN EXPONENTIAL NOTATION?*/
                                   D=DIGITS()            /*D   TEMPORARILY STORES NUMBER DIGITS.*/
                                   NUMERIC DIGITS D+D%10 /*ADD  10%  TO THE   DECIMAL DIGITS.   */
                                   !=OLD! * J            /*RE─CALCULATE FOR THE  "LOST"  DIGITS.*/
                                   END                   /*IFF ≡ IF AND ONLY IF.  [↓]           */
            PARSE VAR !  '' -1 _                         /*OBTAIN THE RIGHT-MOST DIGIT OF  !    */
            IF _==0  THEN !=STRIP(!,,0)                  /*STRIP TRAILING ZEROES  IFF  THE ...  */
            END   /*J*/                                  /* [↑]  ...  RIGHT-MOST DIGIT IS ZERO. */
        Z=0                                              /*THE NUMBER OF TRAILING ZEROES IN  !  */
            DO V=5  BY 0  WHILE V<=N                     /*CALCULATE NUMBER OF TRAILING ZEROES. */
            Z=Z + N%V                                    /*BUMP   Z   IF MULTIPLE POWER OF FIVE.*/
            V=V*5                                        /*CALCULATE THE NEXT POWER OF FIVE.    */
            END   /*V*/                                  /* [↑]  WE ONLY ADVANCE  V  BY OURSELF.*/
         
        !=! || COPIES(0, Z)                              /*ADD WATER TO REHYDRATE THE PRODUCT.  */
        IF Z==0  THEN Z='NO'                             /*USE GOODER ENGLISH FOR THE MESSAGE.  */
        SAY N'!  IS      ['LENGTH(!)        " DIGITS  WITH "        Z        ' TRAILING ZEROES]:'
        SAY                                              /*DISPLAY BLANK LINE  (FOR WHITESPACE).*/
        SAY !                                            /*DISPLAY THE FACTORIAL PRODUCT.       */
                                                         /*STICK A FORK IN IT,  WE'RE ALL DONE. */

