//BRXGEN   JOB CLASS=C,REGION=0K
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  DEFINE ALIAS (NAME(BREXX) RELATE(SYS1.UCAT.TSO)) -
         CATALOG(SYS1.VMASTCAT/SECRET)
  SET MAXCC=0
/*
//
        /*REXX PROGRAM TO SHOW A LINE OF TEXT.  */
        SAY 'HELLO WORLD!'

        /* USING VARIABLE */
        YYY = 'HELLO WORLD!'
        SAY YYY

        /* USING LINEOUT */

        CALL LINEOUT ,"HELLO WORLD!"
